---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SystemsAnalysisReportFolder
source: html/6bf2af12-3ad8-bcb4-23e7-ae54ef828f08.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SystemsAnalysisReportFolder Property

"Reports Folder Path"

## Syntax (C#)
```csharp
public static ForgeTypeId SystemsAnalysisReportFolder { get; }
```